espressif/esp-idf/components/soc/esp32s2/register/soc/efuse_reg.h
/** EFUSE_RD_MAC_SPI_SYS_5_REG register
 *  Register 5 of BLOCK1.
 */
#define EFUSE_RD_MAC_SPI_SYS_5_REG (DR_REG_EFUSE_BASE + 0x58)
/** EFUSE_SYS_DATA_PART0_2 : RO; bitpos: [31:0]; default: 0;
 *  Stores the second part of the zeroth part of system data.
 */
#define EFUSE_SYS_DATA_PART0_2    0xFFFFFFFFU
#define EFUSE_SYS_DATA_PART0_2_M  (EFUSE_SYS_DATA_PART0_2_V << EFUSE_SYS_DATA_PART0_2_S)
#define EFUSE_SYS_DATA_PART0_2_V  0xFFFFFFFFU
#define EFUSE_SYS_DATA_PART0_2_S  0

/** EFUSE_RD_SYS_PART1_DATA0_REG register
 *  Register 0 of BLOCK2 (system).
 */
#define EFUSE_RD_SYS_PART1_DATA0_REG (DR_REG_EFUSE_BASE + 0x5c)
/** EFUSE_OPTIONAL_UNIQUE_ID : R; bitpos: [31:0]; default: 0;
 *  Optional unique 128-bit ID
 */
#define EFUSE_OPTIONAL_UNIQUE_ID    0xFFFFFFFFU
#define EFUSE_OPTIONAL_UNIQUE_ID_M  (EFUSE_OPTIONAL_UNIQUE_ID_V << EFUSE_OPTIONAL_UNIQUE_ID_S)
#define EFUSE_OPTIONAL_UNIQUE_ID_V  0xFFFFFFFFU
#define EFUSE_OPTIONAL_UNIQUE_ID_S  0

/** EFUSE_RD_SYS_PART1_DATA1_REG register
 *  Register 1 of BLOCK2 (system).
 */
#define EFUSE_RD_SYS_PART1_DATA1_REG (DR_REG_EFUSE_BASE + 0x60)
/** EFUSE_OPTIONAL_UNIQUE_ID_1 : R; bitpos: [31:0]; default: 0;
 *  Optional unique 128-bit ID
 */
#define EFUSE_OPTIONAL_UNIQUE_ID_1    0xFFFFFFFFU
#define EFUSE_OPTIONAL_UNIQUE_ID_1_M  (EFUSE_OPTIONAL_UNIQUE_ID_1_V << EFUSE_OPTIONAL_UNIQUE_ID_1_S)
#define EFUSE_OPTIONAL_UNIQUE_ID_1_V  0xFFFFFFFFU
#define EFUSE_OPTIONAL_UNIQUE_ID_1_S  0

/** EFUSE_RD_SYS_PART1_DATA2_REG register
 *  Register 2 of BLOCK2 (system).
 */
#define EFUSE_RD_SYS_PART1_DATA2_REG (DR_REG_EFUSE_BASE + 0x64)
/** EFUSE_OPTIONAL_UNIQUE_ID_2 : R; bitpos: [31:0]; default: 0;
 *  Optional unique 128-bit ID
 */
#define EFUSE_OPTIONAL_UNIQUE_ID_2    0xFFFFFFFFU
#define EFUSE_OPTIONAL_UNIQUE_ID_2_M  (EFUSE_OPTIONAL_UNIQUE_ID_2_V << EFUSE_OPTIONAL_UNIQUE_ID_2_S)
#define EFUSE_OPTIONAL_UNIQUE_ID_2_V  0xFFFFFFFFU
#define EFUSE_OPTIONAL_UNIQUE_ID_2_S  0

/** EFUSE_RD_SYS_PART1_DATA3_REG register
 *  Register 3 of BLOCK2 (system).
 */
#define EFUSE_RD_SYS_PART1_DATA3_REG (DR_REG_EFUSE_BASE + 0x68)
/** EFUSE_OPTIONAL_UNIQUE_ID_3 : R; bitpos: [31:0]; default: 0;
 *  Optional unique 128-bit ID
 */
#define EFUSE_OPTIONAL_UNIQUE_ID_3    0xFFFFFFFFU
#define EFUSE_OPTIONAL_UNIQUE_ID_3_M  (EFUSE_OPTIONAL_UNIQUE_ID_3_V << EFUSE_OPTIONAL_UNIQUE_ID_3_S)
#define EFUSE_OPTIONAL_UNIQUE_ID_3_V  0xFFFFFFFFU
#define EFUSE_OPTIONAL_UNIQUE_ID_3_S  0

/** EFUSE_RD_SYS_PART1_DATA4_REG register
 *  Register 4 of BLOCK2 (system).
 */
#define EFUSE_RD_SYS_PART1_DATA4_REG (DR_REG_EFUSE_BASE + 0x6c)
/** EFUSE_ADC_CALIB : R; bitpos: [3:0]; default: 0;
 *  4 bit of ADC calibration
 */
#define EFUSE_ADC_CALIB    0x0000000FU
#define EFUSE_ADC_CALIB_M  (EFUSE_ADC_CALIB_V << EFUSE_ADC_CALIB_S)
#define EFUSE_ADC_CALIB_V  0x0000000FU
#define EFUSE_ADC_CALIB_S  0
/** EFUSE_BLK_VERSION_MINOR : R; bitpos: [6:4]; default: 0;
 *  BLK_VERSION_MINOR of BLOCK2: 0-No ADC calib; 1-ADC calib V1; 2-ADC calib V2
 */
#define EFUSE_BLK_VERSION_MINOR    0x00000007U
#define EFUSE_BLK_VERSION_MINOR_M  (EFUSE_BLK_VERSION_MINOR_V << EFUSE_BLK_VERSION_MINOR_S)
#define EFUSE_BLK_VERSION_MINOR_V  0x00000007U
#define EFUSE_BLK_VERSION_MINOR_S  4
/** EFUSE_TEMP_CALIB : R; bitpos: [15:7]; default: 0;
 *  Temperature calibration data
 */
#define EFUSE_TEMP_CALIB    0x000001FFU
#define EFUSE_TEMP_CALIB_M  (EFUSE_TEMP_CALIB_V << EFUSE_TEMP_CALIB_S)
#define EFUSE_TEMP_CALIB_V  0x000001FFU
#define EFUSE_TEMP_CALIB_S  7
/** EFUSE_RTCCALIB_V1IDX_A10H : R; bitpos: [23:16]; default: 0; */
#define EFUSE_RTCCALIB_V1IDX_A10H    0x000000FFU
#define EFUSE_RTCCALIB_V1IDX_A10H_M  (EFUSE_RTCCALIB_V1IDX_A10H_V << EFUSE_RTCCALIB_V1IDX_A10H_S)
#define EFUSE_RTCCALIB_V1IDX_A10H_V  0x000000FFU
#define EFUSE_RTCCALIB_V1IDX_A10H_S  16
/** EFUSE_RTCCALIB_V1IDX_A11H : R; bitpos: [31:24]; default: 0; */
#define EFUSE_RTCCALIB_V1IDX_A11H    0x000000FFU
#define EFUSE_RTCCALIB_V1IDX_A11H_M  (EFUSE_RTCCALIB_V1IDX_A11H_V << EFUSE_RTCCALIB_V1IDX_A11H_S)
#define EFUSE_RTCCALIB_V1IDX_A11H_V  0x000000FFU
#define EFUSE_RTCCALIB_V1IDX_A11H_S  24

/** EFUSE_RD_SYS_PART1_DATA5_REG register
 *  Register 5 of BLOCK2 (system).
 */
#define EFUSE_RD_SYS_PART1_DATA5_REG (DR_REG_EFUSE_BASE + 0x70)
/** EFUSE_RTCCALIB_V1IDX_A12H : R; bitpos: [7:0]; default: 0; */
#define EFUSE_RTCCALIB_V1IDX_A12H    0x000000FFU
#define EFUSE_RTCCALIB_V1IDX_A12H_M  (EFUSE_RTCCALIB_V1IDX_A12H_V << EFUSE_RTCCALIB_V1IDX_A12H_S)
#define EFUSE_RTCCALIB_V1IDX_A12H_V  0x000000FFU
#define EFUSE_RTCCALIB_V1IDX_A12H_S  0
/** EFUSE_RTCCALIB_V1IDX_A13H : R; bitpos: [15:8]; default: 0; */
#define EFUSE_RTCCALIB_V1IDX_A13H    0x000000FFU
#define EFUSE_RTCCALIB_V1IDX_A13H_M  (EFUSE_RTCCALIB_V1IDX_A13H_V << EFUSE_RTCCALIB_V1IDX_A13H_S)
#define EFUSE_RTCCALIB_V1IDX_A13H_V  0x000000FFU
#define EFUSE_RTCCALIB_V1IDX_A13H_S  8
/** EFUSE_RTCCALIB_V1IDX_A20H : R; bitpos: [23:16]; default: 0; */
#define EFUSE_RTCCALIB_V1IDX_A20H    0x000000FFU
#define EFUSE_RTCCALIB_V1IDX_A20H_M  (EFUSE_RTCCALIB_V1IDX_A20H_V << EFUSE_RTCCALIB_V1IDX_A20H_S)
#define EFUSE_RTCCALIB_V1IDX_A20H_V  0x000000FFU
#define EFUSE_RTCCALIB_V1IDX_A20H_S  16
/** EFUSE_RTCCALIB_V1IDX_A21H : R; bitpos: [31:24]; default: 0; */
#define EFUSE_RTCCALIB_V1IDX_A21H    0x000000FFU
#define EFUSE_RTCCALIB_V1IDX_A21H_M  (EFUSE_RTCCALIB_V1IDX_A21H_V << EFUSE_RTCCALIB_V1IDX_A21H_S)
#define EFUSE_RTCCALIB_V1IDX_A21H_V  0x000000FFU
#define EFUSE_RTCCALIB_V1IDX_A21H_S  24

/** EFUSE_RD_SYS_PART1_DATA6_REG register
 *  Register 6 of BLOCK2 (system).
 */
#define EFUSE_RD_SYS_PART1_DATA6_REG (DR_REG_EFUSE_BASE + 0x74)
/** EFUSE_RTCCALIB_V1IDX_A22H : R; bitpos: [7:0]; default: 0; */
#define EFUSE_RTCCALIB_V1IDX_A22H    0x000000FFU
#define EFUSE_RTCCALIB_V1IDX_A22H_M  (EFUSE_RTCCALIB_V1IDX_A22H_V << EFUSE_RTCCALIB_V1IDX_A22H_S)
#define EFUSE_RTCCALIB_V1IDX_A22H_V  0x000000FFU
#define EFUSE_RTCCALIB_V1IDX_A22H_S  0
/** EFUSE_RTCCALIB_V1IDX_A23H : R; bitpos: [15:8]; default: 0; */
#define EFUSE_RTCCALIB_V1IDX_A23H    0x000000FFU
#define EFUSE_RTCCALIB_V1IDX_A23H_M  (EFUSE_RTCCALIB_V1IDX_A23H_V << EFUSE_RTCCALIB_V1IDX_A23H_S)
#define EFUSE_RTCCALIB_V1IDX_A23H_V  0x000000FFU
#define EFUSE_RTCCALIB_V1IDX_A23H_S  8
/** EFUSE_RTCCALIB_V1IDX_A10L : R; bitpos: [21:16]; default: 0; */
#define EFUSE_RTCCALIB_V1IDX_A10L    0x0000003FU
#define EFUSE_RTCCALIB_V1IDX_A10L_M  (EFUSE_RTCCALIB_V1IDX_A10L_V << EFUSE_RTCCALIB_V1IDX_A10L_S)
#define EFUSE_RTCCALIB_V1IDX_A10L_V  0x0000003FU
#define EFUSE_RTCCALIB_V1IDX_A10L_S  16
/** EFUSE_RTCCALIB_V1IDX_A11L : R; bitpos: [27:22]; default: 0; */
#define EFUSE_RTCCALIB_V1IDX_A11L    0x0000003FU
#define EFUSE_RTCCALIB_V1IDX_A11L_M  (EFUSE_RTCCALIB_V1IDX_A11L_V << EFUSE_RTCCALIB_V1IDX_A11L_S)
#define EFUSE_RTCCALIB_V1IDX_A11L_V  0x0000003FU
#define EFUSE_RTCCALIB_V1IDX_A11L_S  22
/** EFUSE_RTCCALIB_V1IDX_A12L : R; bitpos: [31:28]; default: 0; */
#define EFUSE_RTCCALIB_V1IDX_A12L    0x0000000FU
#define EFUSE_RTCCALIB_V1IDX_A12L_M  (EFUSE_RTCCALIB_V1IDX_A12L_V << EFUSE_RTCCALIB_V1IDX_A12L_S)
#define EFUSE_RTCCALIB_V1IDX_A12L_V  0x0000000FU
#define EFUSE_RTCCALIB_V1IDX_A12L_S  28

/** EFUSE_RD_SYS_PART1_DATA7_REG register
 *  Register 7 of BLOCK2 (system).
 */
#define EFUSE_RD_SYS_PART1_DATA7_REG (DR_REG_EFUSE_BASE + 0x78)
/** EFUSE_RTCCALIB_V1IDX_A12L_1 : R; bitpos: [1:0]; default: 0; */
#define EFUSE_RTCCALIB_V1IDX_A12L_1    0x00000003U
#define EFUSE_RTCCALIB_V1IDX_A12L_1_M  (EFUSE_RTCCALIB_V1IDX_A12L_1_V << EFUSE_RTCCALIB_V1IDX_A12L_1_S)
#define EFUSE_RTCCALIB_V1IDX_A12L_1_V  0x00000003U
#define EFUSE_RTCCALIB_V1IDX_A12L_1_S  0
/** EFUSE_RTCCALIB_V1IDX_A13L : R; bitpos: [7:2]; default: 0; */
#define EFUSE_RTCCALIB_V1IDX_A13L    0x0000003FU
#define EFUSE_RTCCALIB_V1IDX_A13L_M  (EFUSE_RTCCALIB_V1IDX_A13L_V << EFUSE_RTCCALIB_V1IDX_A13L_S)
#define EFUSE_RTCCALIB_V1IDX_A13L_V  0x0000003FU
#define EFUSE_RTCCALIB_V1IDX_A13L_S  2
/** EFUSE_RTCCALIB_V1IDX_A20L : R; bitpos: [13:8]; default: 0; */
#define EFUSE_RTCCALIB_V1IDX_A20L    0x0000003FU
#define EFUSE_RTCCALIB_V1IDX_A20L_M  (EFUSE_RTCCALIB_V1IDX_A20L_V << EFUSE_RTCCALIB_V1IDX_A20L_S)
#define EFUSE_RTCCALIB_V1IDX_A20L_V  0x0000003FU
#define EFUSE_RTCCALIB_V1IDX_A20L_S  8
/** EFUSE_RTCCALIB_V1IDX_A21L : R; bitpos: [19:14]; default: 0; */
#define EFUSE_RTCCALIB_V1IDX_A21L    0x0000003FU
#define EFUSE_RTCCALIB_V1IDX_A21L_M  (EFUSE_RTCCALIB_V1IDX_A21L_V << EFUSE_RTCCALIB_V1IDX_A21L_S)
#define EFUSE_RTCCALIB_V1IDX_A21L_V  0x0000003FU
#define EFUSE_RTCCALIB_V1IDX_A21L_S  14
/** EFUSE_RTCCALIB_V1IDX_A22L : R; bitpos: [25:20]; default: 0; */
#define EFUSE_RTCCALIB_V1IDX_A22L    0x0000003FU
#define EFUSE_RTCCALIB_V1IDX_A22L_M  (EFUSE_RTCCALIB_V1IDX_A22L_V << EFUSE_RTCCALIB_V1IDX_A22L_S)
#define EFUSE_RTCCALIB_V1IDX_A22L_V  0x0000003FU
#define EFUSE_RTCCALIB_V1IDX_A22L_S  20
/** EFUSE_RTCCALIB_V1IDX_A23L : R; bitpos: [31:26]; default: 0; */
#define EFUSE_RTCCALIB_V1IDX_A23L    0x0000003FU
#define EFUSE_RTCCALIB_V1IDX_A23L_M  (EFUSE_RTCCALIB_V1IDX_A23L_V << EFUSE_RTCCALIB_V1IDX_A23L_S)
#define EFUSE_RTCCALIB_V1IDX_A23L_V  0x0000003FU
#define EFUSE_RTCCALIB_V1IDX_A23L_S  26

/** EFUSE_RD_USR_DATA0_REG register
 *  Register 0 of BLOCK3 (user).
 */
#define EFUSE_RD_USR_DATA0_REG (DR_REG_EFUSE_BASE + 0x7c)
/** EFUSE_USR_DATA0 : RO; bitpos: [31:0]; default: 0;
 *  Stores the 0th 32 bits of BLOCK3 (user).
 */
#define EFUSE_USR_DATA0    0xFFFFFFFFU
#define EFUSE_USR_DATA0_M  (EFUSE_USR_DATA0_V << EFUSE_USR_DATA0_S)
#define EFUSE_USR_DATA0_V  0xFFFFFFFFU
#define EFUSE_USR_DATA0_S  0

/** EFUSE_RD_USR_DATA1_REG register
 *  Register 1 of BLOCK3 (user).
 */
#define EFUSE_RD_USR_DATA1_REG (DR_REG_EFUSE_BASE + 0x80)
/** EFUSE_USR_DATA1 : RO; bitpos: [31:0]; default: 0;
 *  Stores the 1th 32 bits of BLOCK3 (user).
 */
#define EFUSE_USR_DATA1    0xFFFFFFFFU
#define EFUSE_USR_DATA1_M  (EFUSE_USR_DATA1_V << EFUSE_USR_DATA1_S)
#define EFUSE_USR_DATA1_V  0xFFFFFFFFU
#define EFUSE_USR_DATA1_S  0

/** EFUSE_RD_USR_DATA2_REG register
 *  Register 2 of BLOCK3 (user).
 */
#define EFUSE_RD_USR_DATA2_REG (DR_REG_EFUSE_BASE + 0x84)
/** EFUSE_USR_DATA2 : RO; bitpos: [31:0]; default: 0;
 *  Stores the 2th 32 bits of BLOCK3 (user).
 */
#define EFUSE_USR_DATA2    0xFFFFFFFFU
#define EFUSE_USR_DATA2_M  (EFUSE_USR_DATA2_V << EFUSE_USR_DATA2_S)
#define EFUSE_USR_DATA2_V  0xFFFFFFFFU
#define EFUSE_USR_DATA2_S  0

